In [36]:
import numpy as np
import pandas as pd

# 결측치
df = pd.read_csv('./missingvalue.csv')
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    NaN   NaN    NaN
2  강감찬   90.0  90.0   70.0
3  유관순   80.0  75.0    NaN
4  이순신    NaN  80.0   85.0

In [37]:
df_backup = df.copy()
df.isnull()

    name    kor    eng   math
0  False  False  False  False
1  False   True   True   True
2  False  False  False  False
3  False  False  False   True
4  False   True  False  False

In [38]:
df.isnull().sum()

name    0
kor     2
eng     1
math    2
dtype: int64

In [39]:
df.notnull()

   name    kor    eng   math
0  True   True   True   True
1  True  False  False  False
2  True   True   True   True
3  True   True   True  False
4  True  False   True   True

In [40]:
df.notnull().sum()

name    5
kor     3
eng     4
math    3
dtype: int64

In [41]:
df.loc[5] = ["강감찬", 90, 90, 70]
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    NaN   NaN    NaN
2  강감찬   90.0  90.0   70.0
3  유관순   80.0  75.0    NaN
4  이순신    NaN  80.0   85.0
5  강감찬   90.0  90.0   70.0

In [42]:
df.duplicated(keep=False)

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [43]:
df[df.duplicated(keep="first")]

  name   kor   eng  math
5  강감찬  90.0  90.0  70.0

In [44]:
# df_backup 데이터프레임을 df에 복사한 후, 마지막 데이터는 남기고 나머지 삭제
df.drop_duplicates(keep='last', ignore_index=True, inplace=True)
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    NaN   NaN    NaN
2  유관순   80.0  75.0    NaN
3  이순신    NaN  80.0   85.0
4  강감찬   90.0  90.0   70.0

In [45]:
df.dropna(how='any')

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
4  강감찬   90.0  90.0   70.0

In [46]:
df.dropna(how='all')

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    NaN   NaN    NaN
2  유관순   80.0  75.0    NaN
3  이순신    NaN  80.0   85.0
4  강감찬   90.0  90.0   70.0

In [47]:
# kor에 결측치 데이터가 있다면 제외하고 조회
df.dropna(subset='kor')

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
2  유관순   80.0  75.0    NaN
4  강감찬   90.0  90.0   70.0

In [48]:
# kor, end, math, 결측치 데이터가 있다면 제외하고 조회
df.dropna(subset=['kor', 'eng', 'math'])

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
4  강감찬   90.0  90.0   70.0

In [49]:
# 열 kor에 결측치 값에 0 부여
# df['kor'].fillna(0, inplace=True)
# A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
# The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

#For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.
df.fillna({'kor': 0}, inplace=True)
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    0.0   NaN    NaN
2  유관순   80.0  75.0    NaN
3  이순신    0.0  80.0   85.0
4  강감찬   90.0  90.0   70.0

In [56]:
# 열 math에 결측치 값에 평균값 부여
# df['math'].fillna(df['math'].mean(),inplace=True)
#A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
# The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

#For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.
df.fillna({'math': df['math'].mean()}, inplace=True)
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    0.0  85.0   85.0
2  유관순   80.0  75.0   85.0
3  이순신    0.0  80.0   85.0
4  강감찬   90.0  90.0   70.0

In [58]:
# 열 eng에 결측치 값에 중위수(중위값) 부여
# df['eng'].fillna(df['eng'].median(), inplace=True)
df.fillna({'eng': df['eng'].median()}, inplace=True)
df

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
1  김유신    0.0  85.0   85.0
2  유관순   80.0  75.0   85.0
3  이순신    0.0  80.0   85.0
4  강감찬   90.0  90.0   70.0

In [61]:
df = df_backup
# 김유신, 유관순, 이순신 데이터를 삭제하고 나머지 데이터는 유지시키도록 thresh 명령을 진행
# NaN 값이 아닌 값이 4개 이상인 행만 유지
df.dropna(thresh=4)

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
2  강감찬   90.0  90.0   70.0

In [62]:
#김유신 데이터를 삭제하고 나머지 데이터는 유지시키도록 thresh 명령을 진행
df.dropna(thresh=3)

  name    kor   eng   math
0  홍길동  100.0  95.0  100.0
2  강감찬   90.0  90.0   70.0
3  유관순   80.0  75.0    NaN
4  이순신    NaN  80.0   85.0